import React, {useRef} from "react";
import { useState } from 'react';
import "bootstrap/dist/css/bootstrap.min.css";
import './App.css';
import { Container, Button, Table } from "react-bootstrap";
import { BrowserRouter, Routes, Route, NavLink } from "react-mid-dom";
import Contact from "./Contact";


export function Layout() {
  return (
  <nav className="bg-dark p-2 mb-3 text-center">
    <NavLink to="/" className="link px-2" style={({isActive}) => {
      return {
        textDecoration : isActive ? "none" : "underline",
      };
    }}>หน้าแรก</NavLink>
    <NavLink to="/product" className="link px-2" style={({isActive}) => {
      return {
        textDecoration : isActive ? "none" : "underline",
      };
    }}>ตารางเทียบแคลเลอรี่</NavLink>
    <NavLink to="/contact" className="link px-2" style={({isActive}) => {
      return {
        textDecoration : isActive ? "none" : "underline",
      };
    }}>ผู้จัดทำ</NavLink>
  </nav>
  );
} 

function Index() {
  const header1 = useRef();
  const [product1, setProduct1] = useState();
  const [product2, setProduct2] = useState();
  const [product3, setProduct3] = useState();
 
  return (
    <>
    <Layout/>
    <h3 ref={header1}>อาหารพื้นเมืองที่มัสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานี</h3>

      <div>
        <img src="ปลาส้มทรงเครื่องสมุนไพร.jpg" alt="ปลาส้มทรงเครื่องสมุนไพร" width="15%" /><br />
        ปลาส้มทรงเครื่องสมุนไพร  {product1} เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น มีความโดดเด่นและมีความเป็นเอกลักษณ์ของจังหวัดอุบลราชธานี เป็นต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานทั้งในเรื่องของรสชาติที่กลมกล่อม เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ มีคุณค่าทางสมุนไพรสูง เป็นภูมิปัญญาในการถนอมอาหารด้วยวิธีแปรรูปปลาส้ม เพื่อให้เก็บไว้ได้นานหลายเดือน ใช้ส่วนผสมจากวัตถุดิบธรรมชาติที่มีในท้องถิ่นโดยใช้ส่วนผสมหลัก คือ เนื้อปลา ซึ่งปลาที่นำมาเป็นปลาส้ม จะเลือกใช้ปลาบึกและปลาสวาย ซึ่ง เป็นปลาธรรมชาติจากลุ่มแม่น้ำโขง เนื้อปลามีคุณค่าทางโภชนาการ อุดมไปด้วยโปรตีนสูง ไขมันต่ำ ประกอบกับจังหวัดอุบลราชธานีมีแม่น้ำไหลผ่านถึง 3 สาย ได้แก่ แม่น้ำมูล แม่น้ำชี และแม่น้ำโขง จึงอุดมไปด้วยพันธุ์ปลานานาชนิด จึงได้รับสมญานามยกให้เป็นราชธานีแห่งปลาแซ่บหลาย เมื่อผสมผสานเข้ากับสมุนไพรทอดกรอบที่คลุกเคล้ากับเนื้อปลา ทำให้กลิ่นและรสชาติของปลาส้ม มีเอกลักษณ์ ซึ่งสมุนไพรที่ใช้ทั้งหมด ได้แก่ พริก หอม กระเทียม ขิง ข่า ตะไคร้ ใบมะกรูด ล้วนผ่านการปลูกด้วยวิธีธรรมชาติปลอดสารเคมี มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพ มีสรรพคุณทางยาทำให้ระบบการเผาผลาญทำงานได้ดี ทำให้ความดันโลหิตต่ำ ลดระดับน้ำตาลในเลือด ลดไขมันในเลือดได้ดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย
        จึงถือได้ว่า ปลาส้มทรงเครื่องสมุนไพร เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย ถูกปรุงแต่งและถ่ายทอดสูตรอาหารพื้นเมืองโบราณของจังหวัดอุบลราชธานีมาช้านาน เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
        <Button onClick={()=>{
      header1.current.innerHTML = "React"
      }}>เรียนรู้เพิ่มเติม</Button>
      </div>
      <div>
        <img src="หลนเค็มบักนัด.jpg" alt="หลนเค็มบักนัด" width="15%" /><br />
        หลนเค็มบักนัด  {product2}  หลนเค็มบักนัด เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์เฉพาะของจังหวัดอุบลราชธานี เป็นภูมิปัญญาในการถนอมอาหารด้วยวิธี แปรรูป แบบดองเค็มเพื่อให้เก็บไว้ได้นานเป็นปี เป็นอาหารพื้นเมืองโบราณของจังหวัดอุบลราชธานีมาช้านานที่ได้สืบทอดกันมารุ่นต่อรุ่นใช้ส่วนผสมจากวัตถุดิบธรรมชาติที่มีในท้องถิ่นโดยใช้ส่วนผสมหลัก คือ เนื้อปลา ซึ่งปลาที่นำมาเป็นเค็มบักนัด ส่วนใหญ่จะเลือกใช้เนื้อปลาเทโพหรือปลาสวายติดหนัง นำมาหั่นเป็นชิ้นบางๆ เป็นปลาจากแม่น้ำมูลที่ได้จากผืนดินของจังหวัดอุบลราชธานี แล้วนำมาคลุกเคล้ากับเกลือ เป็น “ เกลือสินเธาว์” จะเป็นเกลือจากที่อื่นหรือ “เกลือจากทะเล” ไม่ได้เป็นอันขาด ถ้านำมาใช้จะเกิดการ “เน่าบูด เสียหาย” ไม่เป็น “เค็มบักนัด” ตามที่ต้องการ และหมากนัดก็ต้องเป็น”หมากนัดหม้อ” จากสวนในจังหวัดอุบลราชธานี สับเนื้อหมากนัดสุกที่สับละเอียดไว้ คลุกเคล้าส่วนผสมทุกอย่างให้เข้าเป็นเนื้อเดียวกันแล้วบรรจุใส่ขวด ปิดฝาให้แน่น หมักดองเก็บไว้จนได้ระยะเวลาที่เหมาะสมก็สามารถนำมารับประทานได้ และเนื่องจากเค็มบักนัดแปลงมาจากคำว่า เค็มหมากนัด เป็นภาษาท้องถิ่นชาวอีสานที่ใช้เรียกขานผลไม้ เช่น หมากนัด คือ สับปะรดแต่สำเนียงภาษาของชาวอุบลราชธานีออกเสียงสั้นไปบ้างจึงออกมาเป็นหมากนัดหรือบักนัด จึงตั้งชื่ออาหารว่า “ เค็มบักนัด” เป็นอาหารพื้นเมืองของชาวอุบลราชธานีมาช้านาน
        ประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพสับปะรดหรือหมากนัด เป็นผลไม้เพื่อสุขภาพ ที่มีประโยชน์อยู่หลากหลาย เพราะอุดมไปด้วยแร่ธาตุและวิตามินต่าง ๆ จำนวนมาก และสรรพคุณสับปะรดทางสมุนไพรนั้น ก็ช่วยรักษาอาการต่าง ๆ ได้อย่างหลากหลายเช่นกัน เพราะเป็นผลไม้ที่มีวิตามินซีจึงช่วยต้านหวัด เสริมสร้างระบบภูมิคุ้มกันในร่างกายให้แข็งแรง สับปะรดยังช่วย ย่อยอาหารจึงแก้อาการท้องผูก ขับถ่ายได้เป็นอย่างดี และมีสรรพคุณช่วยลดความดันโลหิตสูงได้ อีกทั้งรสชาติของเค็มบักนัด จะมีรส เปรี้ยว เค็ม หวาน ที่กลมกล่อมสามารถนำมาปรุงเป็นเมนูอาหารได้หลากหลาย โดยเฉพาะการทำหลนเค็มบักนัด ที่เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ อาทิ หอมแดง ใบมะกรูด พริกขี้หนู เป็นต้น มีสรรพคุณทางยาทำให้ระบบการเผาผลาญทำงานได้ดี ทำให้ความดันโลหิตต่ำ ลดไขมันในเลือดได้ดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย
        จึงถือได้ว่า หลนเค็มบักนัด เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย เป็นกรรมวิธีในการถนอมอาหารของชาวบ้านอีสานสมัยโบราณที่สืบทอดกันมารุ่นต่อรุ่น อย่าง รสเค็มของเกลือสินเธาว์จากภูมิปัญญาในการต้ม เนื้อปลาพื้นบ้านที่หาในแม่น้ำมูลได้ไม่ยาก และได้ความเปรี้ยว หวาน จากสับปะรดในพื้นถิ่นอีสาน ใช้ส่วนผสมจากวัตถุดิบธรรมชาติที่มีในท้องถิ่นที่ผสมผสานรวมกันอย่างลงตัว จนกลายเป็นของหมักของดีถิ่นอีสาน ของจังหวัดอุบลราชธานี
        <Button onClick={()=>{
      header1.current.innerHTML = "React"
      }}>เรียนรู้เพิ่มเติม</Button>
      </div>
      <img src="ผัดไทหมื่นปีห่อใบบัว.jpg" alt="ผัดไทหมื่นปีห่อใบบัว" width="15%" /><br />
        ผัดไทหมื่นปีห่อใบบัว  {product3}  ผัดไทยเป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น มีความโดดเด่นและมีความเป็นเอกลักษณ์ที่มีความประณีตสวยงาม ของจังหวัดอุบลราชธานี มีความเป็นธรรมชาติของส่วนผสมหลักและเครื่องปรุงรส เป็นอาหารที่ให้คุณค่าทางโภชนาการ และมีสารอาหารครบ 5 หมู่ ที่มีประโยชน์ต่อร่างกายครบถ้วน อาทิ คาร์โบไฮเดรตได้มาจากเส้นของก๋วยเตี๋ยว โปรตีน ได้มาจากเนื้อสัตว์ กุ้งแห้ง และถั่วลิสง ไขมันได้มาจากน้ำมันพืช วิตามินและเกลือแร่ได้จากเครื่องเคียงพืชผักสมุนไพรและเครื่องปรุงรส ที่มีครบทุกรสคือ เปรี้ยว หวาน เค็ม มัน เพิ่มรสชาติความเปรี้ยว ด้วย น้ำมะขามเปียก มะนาว รสหวานได้จากน้ำตาล รสเค็มได้จากน้ำปลา กุ้งแห้ง และรสมัน ได้จากถั่วลิสงคั่วป่น เติมความเผ็ดด้วยพริกป่น โรยหน้าด้วยต้นหอมและผักชี เป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีรสชาติกลมกล่อม เพิ่มเสน่ห์ของความเป็นไทย ด้วยการห่อผัดไทยด้วยใบบัว สรรพคุณ ของใบบัวที่ใช้ห่อนั้น ช่วยต้านอนุมูลอิสระ ส่งผลดีต่อระบบของร่างกาย ช่วยบำรุงหัวใจได้เป็นอย่างดี และยังเพิ่มความหอมของผัดไทยมากยิ่งขึ้น รับประทานกับเครื่องเคียงผักพื้นบ้านนานาชนิด อาทิ หัวปลี ถั่วงอก ใบกุยช่าย ใบบัวบก เป็นต้น ซึ่งมีคุณค่าทางสมุนไพรสูง มีใยอาหารสูง มีวิตามิน และเกลือแร่ที่สำคัญ อยู่ในส่วนประกอบของอาหารและในส่วนที่เป็นเครื่องเคียง อุดมด้วยพืชผักสมุนไพรมากมายหลายชนิด ซึ่งมีสรรพคุณทางยาจากสารพฤกษเคมี ช่วยต้านอนุมูลอิสระ ส่งเสริมระบบภูมิคุ้มกัน แก้อาการช้ำใน ลดอาการอักเสบ ช่วยบำรุงเลือด บำรุงหัวใจ บำรุงประสาท และสมอง เพิ่มความสามารถในการจำ ลดความเสี่ยงอัลไซเมอร์ สมองเสื่อมและลดอัตราเสี่ยงต่อการเกิดโรค เช่น ช่วยลดระดับโคเลสเตอรอลในเลือด ลดความดันโลหิต ป้องกันโรคมะเร็ง เป็นต้น ซึ่งล้วนแล้วแต่มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น
    จึงถือได้ว่าผัดไทยหมื่นปีห่อใบบัว เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด ที่ช่วยเสริมภูมิต้านทานและป้องกันโรค เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
        <Button onClick={()=>{
      header1.current.innerHTML = "React"
      }}>เรียนรู้เพิ่มเติม</Button>
    </>
  );
}

function Product() {
  const table = useRef();
  const tr = useRef([]);
  const added = (i) => {
    const index = tr.current[i].rowIndex;
    table.current.added(index);
  }

  const data = [
    ["ปล้าส้มทรงเครื่อง ",1200],
    ["หลนเค็มบักนัด ",1100],
    ["ผัดไทหมื่นปีห่อใบบัว ",1800],
  ]
  return (
    <>
      <Layout/>
      <h4>Products</h4>
      <Table striped bordered hover className="my-3" ref={table}>
        <thead>
          <tr>
            <th>เมนูอาหาร</th>
            <th>พลังงานที่ได้รับ</th>
            <th>เลือกเมนูนี้</th>
          </tr>
        </thead>
        <tbody>
          {data.map((item, i) => {
            return (
              <tr ref={(el) => {tr.current[i] = el;}} key={i}>
                <td>{item[0]}</td>
                <td>{item[1]}</td>
                <td className="text-center"><Button variant="danger" onClick={() => added(i)}>เลือกเมนูนี้</Button></td>
              </tr>
            );
          })}
        </tbody>
      </Table>
    </>
  );
}

function App() {
  return (
    <BrowserRouter>
    <Container className="p-3 my-3 bg-light">
      <Routes>
        <Route path="/" element={<Index/>}/>
        <Route path="/main" element={<Index/>}/>
        <Route path="/product" element={<Product/>}/>
        <Route path="/contact" element={<Contact/>}/>
      </Routes>
    </Container>
    </BrowserRouter>
  );
}

export default App;